<?php

use ReenExe\PhoneSearcher;

class PhoneSearcherTest extends AbstractSearcherTest
{
    public function dataProvider()
    {
        yield [
            '',
            []
        ];

        yield [
            'Контакты: (044) 465-5-465',
            [
                '(044) 465-5-465',
            ]
        ];

        yield [
            'Phone: +38 (044) 237-70-70',
            [
                '+38 (044) 237-70-70',
            ]
        ];

        yield [
            'Контакты: 044-270-0000, 063-237-2525, 050-588-2323, 067-285-0505',
            [
                '044-270-0000',
                '063-237-2525',
                '050-588-2323',
                '067-285-0505',
            ]
        ];

        yield [
            'Контакты: (093)290-37-85, (096)469-02-73, (066)252-36-81',
            [
                '(093)290-37-85',
                '(096)469-02-73',
                '(066)252-36-81',
            ]
        ];

        yield [
            'Контакты: (044) 22-76-555, (093) 970-70-99, (067) 417-68-68, (095) 283-19-91',
            [
                '(044) 22-76-555',
                '(093) 970-70-99',
                '(067) 417-68-68',
                '(095) 283-19-91',
            ]
        ];
    }

    protected function getSearcher()
    {
        return new PhoneSearcher();
    }
}
